In [1]:
def f(x,y):
    return x+y
f(1,4)

5

In [2]:
f = lambda x,y: x+y
f(1,4)

5

In [3]:
f = lambda x: x/2 #하나의 argument만 처리하는 lambda함수
f(3)

1.5

In [4]:
f = lambda x:x**2
f(3)

9

In [5]:
(lambda x:x+1)(5) # 이름을 할당하지 않는 lambda함수

6

In [6]:
ex = [1,2,3,4,5]
f = lambda x:x **2
list(map(f, ex)) #map 함수는 함수와 sequence형 데이터를 인자로 받아, 각 element마다 입력받은 함수를 적용하여 list로 반환.
                 #일반적으로 함수를 lambda형태로 표현함.

[1, 4, 9, 16, 25]

In [7]:
f = lambda x, y: x+y
list(map(f,ex,ex))

[2, 4, 6, 8, 10]

In [8]:
list(map(lambda x:x+x, ex))

[2, 4, 6, 8, 10]

In [9]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [10]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [11]:
s1.map(lambda x:x**2).head(5) #Pandas의 series type의 데이터에도 map함수 사용가능
                               #function 대신 dict, sequence형 자료등으로 대체 가능

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [12]:
z = {1:'A', 2:'B', 3:'C'} #dict type으로 데이터 교체. 없는 값은 NaN
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [13]:
s2 = Series(np.arange(10,20)) #같은 위치의 데이터를 s2로 전환
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [14]:
df = pd.read_csv("data/wages.csv")
df.head() #모델은 숫자로 되어 있어야 함.

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [15]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [16]:
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [17]:
df.sex.replace({"male":0, "female":1}).head() #dict type 적용.

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [18]:
df.sex.replace(["male", "female"],[0,1], inplace=True) # Target list, Conversion list
                                                       # inplace <- 데이터 변환결과를 적용.
df.head(5)

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [19]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [20]:
f = lambda x : x.max() - x.min()
df_info.apply(f) # map()과는 달리 apply는 Series 전체(column)에 해당 함수를 적용
                 # 입력값이 Series 데이터로 입력받아 handling 가능.
                 # 각 column 별로 결과값 반환.

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [21]:
df_info.sum() # 내장 연산 함수를 사용할 때도 똑같은 효과를 거둘 수 있음.
              # mean(평균), std(표준편차)등 사용 가능
              # axis = 1도 가능.

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [22]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [23]:
def f(x):
    return Series([x.min(), x.max()], index=["min","max"]) #Scalar 값 이외에 Series값의 반환도 가능하다. mean, std도 뽑을 수 있다.
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

In [24]:
f = lambda x : -x
df_info.applymap(f).head(5) #series 단위가 아닌 element단위로 함수를 적용함.
                            #series 단위에 apply를 적용시킬 때와 같은 효과.

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [25]:
f = lambda x : -x
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64